# -*-coding:utf-8 -*-

"""
# File       : error_status_code.py
# Time       : 2025-07-24 21:22:06
# Author     : lyx
# version    : python 3.11
# Description: 状态码
                  规则: 字母开头为业务码，数字开头为系统码
                  
                        业务码的格式：  aabbcc(包含字母数字)  前两位表示业务模块，中间两位表示接口，后面两位表示错误码
                        
"""
code_dict = {
    # region ******************** 系统码 start ******************** #
    # 0~99 系统基本状态
    "0": "请求成功",
    "1": "请求失败",
    "2": "系统配置错误",
    "3": "接口码[{code}]未注册",
    
    # 100~599 为Http状态码保留码
    
    # endregion ****************** 系统码 end ********************* #
    
}